Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: {project-name} relies on the JBoss Logging library for logging. If your dependencies use other logging APIs, such as Apache Commons Logging, Log4j, or SLF4J, exclude those libraries and use a JBoss Logging adapter. This step is especially important for native executables, because the native build can fail with errors such as the following:
ja_jp: {project-name} はロギングを JBoss Logging ライブラリーに依存しています。依存関係が Apache Commons Logging、Log4j、SLF4J などの他のロギング API を使用している場合は、それらのライブラリーを除外し、JBoss Logging アダプターを使用してください。ネイティブビルドが以下のようなエラーで失敗する可能性があるため、この手順はネイティブ実行可能ファイルにとって特に重要です。

source: {project-name} uses a pattern-based logging formatter that generates human-readable text logs by default, but you can also configure the format for each log handler by using a dedicated property.
ja_jp: {project-name} は、人間が判読できるテキストログを生成するパターンベースのロギングフォーマッターをデフォルトで使用します。ただし、専用のプロパティーを使用して各ログハンドラーのフォーマットを設定することもできます。

source: Εxception mappers defined in REST endpoint classes will only be called if the exception is thrown in the same class. If you want to define global exception mappers, simply define them outside a REST endpoint class:
ja_jp: REST エンドポイントクラスで定義された例外マッパーは、例外が同じクラスで出力された場合にのみ呼び出されます。グローバル例外マッパーを定義する場合は、REST エンドポイントクラスの外部で定義するだけです。

source: ⚠️ Important: These types are only available when using the Classic RESTEasy stack (quarkus-resteasy / quarkus-resteasy-jackson) because they rely on the Servlet API provided by Undertow (quarkus-undertow).
ja_jp: ⚠️ 重要: これらの型は、Undertow (quarkus-undertow) が提供する Servlet API に依存しているため、Classic RESTEasy スタック (quarkus-resteasy / quarkus-resteasy-jackson) を使用している場合にのみ利用可能です。

source: 😀, for Vert.x
ja_jp: 😀、Vert.xの場合

source: 😀, for Vert.x and HTTP
ja_jp: 😀、Vert.x と HTTP の場合
